const story_dialogs = [  // 改其他內容 因為與rule_desc重複
    ["遊戲規則一：問答環節中系統不會透露性別。", !1, "s"],  
    ["遊戲規則二：最後僅能向一位參加者寄送邀請，如果對方接受邀請則成功配對。", !1, "s"]
];

const card = [
    '遊戲規則卡', 
    [
        ['<span class="a-point">作弊遊戲</span> ( designed by:雪人清酒 )']
        ['這是一場考題太難而你又沒有準備的考試，你唯一能依靠的方式只有<span class="a-point">作弊</span>！'],
        ['而想要在考試中<span class="a-point">作弊</span>，最簡單也最直接的方法就是找到潛伏在你們之中的<span class="a-point">槍手</span>！']
    ],[
        ['遊戲規則1：玩家之中會有至少一位是<span class="a-point">槍手</span>，無論如何，<span class="a-point">槍手</span>的答案永遠是對的。'],
        ['遊戲規則2：遊戲中僅能向一位玩家寄送邀請，如果對方接受邀請則成功配對。'],
        ['遊戲規則3：只要能找到<span class="a-point">槍手</span>，寄送邀請並完成配對，則該名玩家勝利。'],
        ['遊戲規則4：若<span class="a-point">槍手</span>主動找其他玩家寄送邀請，則接受配對的該名玩家勝利。'],
        ['遊戲規則5：遊戲過程中系統不會透露性別。'],
    ]

];

const end_dialogs = [
    ["", !1, "w"],
    ["", !1, "w"],
    ["", !1, "w"],
    ["問題環節結束！請打開左側玩家選單，向一位參加者寄送邀請。 如果不想與任何參加者配對，則可按右上方的離開鍵。", !1, "s"],
    ["平台目前仍在處在beta階段，目前還沒有適合的劇本可以使用，非常想要獲得大家的意見，也歡迎對平台有興趣的朋友加入！ https://forms.gle/Z4HBacchG9yif3QGA",!1, "s"]
];