const story_dialogs = [
    ["遊戲規則一：問答環節中系統不會透露性別。", !1, "s"],
    ["遊戲規則二：最後僅能向一位參加者寄送邀請，如果對方接受邀請則成功配對。", !1, "s"],
    ["=== 遊戲開始 請等待出題 ===", !1, "s"]
];

const rule_desc = [
    ["遊戲規則一：問答環節中系統不會透露性別。"],
    ["遊戲規則二：最後僅能向一位參加者寄送邀請，如果對方接受邀請則成功配對。"]
];

const end_dialogs = [
    ["", !1, "w"],
    ["", !1, "w"],
    ["", !1, "w"],
    ["問題環節結束！請打開左側玩家選單，向一位參加者寄送邀請。 如果不想與任何參加者配對，則可按右上方的離開鍵。", !1, "s"],
    ["平台目前仍在處在beta階段，目前還沒有適合的劇本可以使用，非常想要獲得大家的意見，也歡迎對平台有興趣的朋友加入！ https://forms.gle/Z4HBacchG9yif3QGA",!1, "s"]
];