const story_dialogs = [
    ["配對人數：2女 vs 3男", !1,"s"],
    ["<span class='a-point'>name1</span>😎", !1,"s"],
    ["<span class='a-point'>name1</span>😎", !1,"s"],
    ["<span class='a-point'>name1</span>😎", !1,"s"],
    ["<span class='a-point'>name1</span>😎", !1,"s"],
    ["<span class='a-point'>name1</span>😎", !1,"s"],
    ["遊戲規則一：問答環節中系統不會透露性別。", !1, "s"],
    ["遊戲規則二：最後僅能向一位參加者寄送邀請，如果對方接受邀請則成功配對。", !1, "s"],
    ["問題1：如果只看暱稱，你認為<span class='a-point'>name1</span>是個怎麼樣的人？ (限時時間: 1min)", !1, "s"],
    ["問題2：你平時的休閒娛樂是什麼？ (限時時間: 1min)", !1, "s"],
    ["問題3：如果要推薦一部電影，你會選哪一部？ (限時時間: 1min)", !1, "s"],
    ["問題4：你最近在看的Youtuber頻道是？ (限時時間: 1min)", !1, "s"],
    ["問題5：你心目中最好看的電視劇影集是？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，你認為哪位參加者可能顏值最高？ (限時時間: 1min)", !1, "s"],
    ["問題五：你交過幾任男朋友/女朋友？ (限時時間: 1min)", !1, "s"],
    ["問題五：你最近最常聽的音樂是？ (限時時間: 1min)", !1, "s"],
    ["問題五：DCARD或PPT最常逛的看板是？ (限時時間: 1min)", !1, "s"],
    ["問題五：剛認識的異性對象，你會先問他/她什麼問題？ (限時時間: 1min)", !1, "s"],
    ["問題五：是否有在打遊戲？請說出你最近在玩的遊戲(手遊, 桌遊, 電玩...等)？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，所有參加者中你認為誰是渣男/渣女？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，所有參加者中你認為誰最好相處？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，所有參加者中你認為誰最色？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，<span class='a-point'>name1</span>和<span class='a-point'>name2</span>掉到水裡，你會先救誰？ (限時時間: 1min)", !1, "s"],
    ["問題五：半夜肚子餓，最常吃的宵夜是什麼？ (限時時間: 1min)", !1, "s"],
    ["問題五：哪間飲料店的哪個飲品是你最常點的呢？ (限時時間: 1min)", !1, "s"],
    ["問題五：最喜歡吃的食物是什麼？ (限時時間: 1min)", !1, "s"],
    ["問題五：最近有出去玩嗎？最近一次出遊在哪？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果有時光機，你最想認識哪位歷史人物，為什麼？ (限時時間: 1min)", !1, "s"],
    ["問題五：你近期最想去的國家是哪裡？ (限時時間: 1min)", !1, "s"],
    ["問題五：哪一種動物最能代表你這個人？ (限時時間: 1min)", !1, "s"],
    ["問題五：你最想從事的職位或工作是什麼？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果能自由選擇且不考慮薪水高低，你最想在哪間企業工作？ (限時時間: 1min)", !1, "s"],
    ["問題五：如果只看暱稱，其他參加者都陷於火場中，你會先放棄救誰？ (限時時間: 1min)", !1, "s"],
    ["問題五：中午或晚餐最常吃什麼？ (限時時間: 1min)", !1, "s"],
    ["最後請打開左側玩家選單，向一位參加者寄送邀請。 如果不想與任何參加者配對，則可按右上方的離開鍵。", !1, "s"]];

const role_desc_dialogs = {
    1:[
        ["<span class='a-point'>審問</span>：" + 
        "左側名單是昨晚與妳待在酒吧的<span class='a-point'>嫌疑人</span>，只有其中一位是真正發生關係的<span class='a-point'>渣男</span>，請選擇任何一位嫌疑人單獨進行<span class='a-point'>審問</span>吧。",0,"s"],
        ["<span class='a-point'>推理</span>：" +
        "每一輪最後偵探將進行<span class='a-point'>推理</span>，若成功識別個別<span class='a-point'>嫌疑人</span>昨晚所做的事，則該名嫌疑人失敗出局，直到找出嫌疑人中的<span class='a-point'>渣男</span>則偵探勝利，成功破案遊戲結束。",0,"s"]],
    0:[
        ["<span class='a-point'>調查</span>：" +
        "你可以<span class='a-point'>調查</span>左側名單上的嫌疑人，可查看對方昨晚可能做的事。",0,"s"],
        [ "<span class='a-point'>線索</span>：" +
        "<span class='a-point'>調查</span>完之後，可向<span class='a-point'>偵探</span>傳送一句話做為<span class='a-point'>線索</span>。除此之外偵探會對每一位嫌疑人進行審問，你必須想辦法不讓<span class='a-point'>偵探</span>識別自己昨晚所做的事，若被成功識別則失敗出局。",0,"s"]]
};

const role_desc = {
    1:[""],
    0:["若偵探成功找出嫌疑人中的渣男，則其餘嫌疑人勝利，成功洗刷罪名。 <br> 反之嫌疑人中的渣男未被找出，則渣男勝利，成功躲過。"]
};

const end_dialogs = [


];